{
  "architectures": [
    "DepthAnythingForDepthEstimation"
  ],
  "backbone": null,
  "backbone_config": {
    "apply_layernorm": true,
    "architectures": [
      "Dinov2Model"
    ],
    "attention_probs_dropout_prob": 0.0,
    "drop_path_rate": 0.0,
    "dtype": "float32",
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 384,
    "image_size": 518,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-06,
    "layerscale_value": 1.0,
    "mlp_ratio": 4,
    "model_type": "dinov2",
    "num_attention_heads": 6,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "out_features": [
      "stage3",
      "stage6",
      "stage9",
      "stage12"
    ],
    "out_indices": [
      3,
      6,
      9,
      12
    ],
    "patch_size": 14,
    "qkv_bias": true,
    "reshape_hidden_states": false,
    "stage_names": [
      "stem",
      "stage1",
      "stage2",
      "stage3",
      "stage4",
      "stage5",
      "stage6",
      "stage7",
      "stage8",
      "stage9",
      "stage10",
      "stage11",
      "stage12"
    ],
    "use_mask_token": true,
    "use_swiglu_ffn": false
  },
  "depth_estimation_type": "metric",
  "dtype": "float32",
  "fusion_hidden_size": 64,
  "head_hidden_size": 32,
  "head_in_index": -1,
  "initializer_range": 0.02,
  "max_depth": 20,
  "model_type": "depth_anything",
  "neck_hidden_sizes": [
    48,
    96,
    192,
    384
  ],
  "patch_size": 14,
  "reassemble_factors": [
    4,
    2,
    1,
    0.5
  ],
  "reassemble_hidden_size": 384,
  "transformers_version": "5.12.0"
}
